; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-2-3-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p1-2 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p3-1 - location
	p3-4 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s2)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at package1 s3)
	(at package2 s4)
	(at package3 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(link s0 s3)
	(link s3 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s2)
	(link s2 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s0)
	(link s0 s4)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s3)
	(at truck2 s1)
	(at truck3 s2)
	(at package1 s0)
	(at package2 s3)
	(at package3 s0)
	))


)

; plan
1. (walk driver2 s2 p2-4)
   deleted: (at driver2 s2)
   added: (at driver2 p2-4)
   goals met: 0 of 7
2. (walk driver2 p2-4 s4)
   deleted: (at driver2 p2-4)
   added: (at driver2 s4)
   goals met: 0 of 7
3. (walk driver1 s1 p0-1)
   deleted: (at driver1 s1)
   added: (at driver1 p0-1)
   goals met: 0 of 7
4. (walk driver1 p0-1 s0)
   deleted: (at driver1 p0-1)
   added: (at driver1 s0)
   goals met: 1 of 7
5. (load-truck package3 truck2 s4)
   deleted: (at package3 s4)
   added: (in package3 truck2)
   goals met: 1 of 7
6. (load-truck package2 truck2 s4)
   deleted: (at package2 s4)
   added: (in package2 truck2)
   goals met: 1 of 7
7. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 1 of 7
8. (drive-truck truck2 s4 s3 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 1 of 7
9. (unload-truck package2 truck2 s3)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   goals met: 2 of 7
10. (load-truck package1 truck2 s3)
   deleted: (at package1 s3)
   added: (in package1 truck2)
   goals met: 2 of 7
11. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 2 of 7
12. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   goals met: 3 of 7
13. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   goals met: 4 of 7
14. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 7
15. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 4 of 7
16. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 4 of 7
17. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 5 of 7
18. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 5 of 7
19. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   goals met: 5 of 7
20. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   goals met: 6 of 7
21. (walk driver2 s1 p3-1)
   deleted: (at driver2 s1)
   added: (at driver2 p3-1)
   goals met: 6 of 7
22. (walk driver2 p3-1 s3)
   deleted: (at driver2 p3-1)
   added: (at driver2 s3)
   goals met: 7 of 7
